Autodesk.Revit.DB.Structure.PathReinforcementType.CreateDefaultPathReinforcementType(Autodesk.Revit.DB.Document)
Creates a new PathReinforcementType object with a default name.
ADoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.PathReinforcementType
An object that specifies the type of a Structural Path Reinforcement element in Autodesk Revit.
Remarks:
The clear cover settings can be accessed via this object.